const improvisation = {"драфт":" — Draft (англ) — план, набросок, проект, черновик. В юриспруденции \"драфт договора\" - это форма договора, т.н. \"рыба\", первоначальная версия договора, исходящая от одной стороны договора, не подвергавшаяся еще изменениям другой стороны договора.",
"кейс" : " — кейс (от англ. case — «обстоятельства») — реальный случай, на котором разбираются теоретические идеи (см. Метод кейсов).",
"кипиай" : " — ключевые показатели эффективности (KPI) – это методика, разработанная для оценки производительности организации, отдельно взятых ее частей или даже одного сотрудника за заданный период. То есть это индикатор фактически достигнутых результатов, измеряемый количественно.",
"девелопер": " — тот, кто занимается созданием и реконструкцией объектов недвижимости, а также развитием земельных активов. Его основная цель — увеличить прибыль от реализации проекта. Основные задачи девелопера. Девелопер проводит экономический анализ инвестиций и осуществляет проектирование будущего объекта, занимается выбором подходящего земельного участка для строительства.",
"копирайт":"копирайт (Copyright ©) — специальный знак, который подтверждает, что информационный продукт защищён авторскими правами.",
"биг дил":" — крупная сделка, важное событие.",
"кост":" — цена",
"фидбек":" — способ коммуникации, когда люди делятся своей точкой зрения с другими, чтобы что-то изменить. Обратная связь",
"кофаундер":" — способ коммуникации, когда люди делятся своей точкой зрения с другими, чтобы что-то изменить. Обратная связь",
"бизнес коучинг":" — cистема профессиональных взаимоотношений между специалистом по развитию и росту бизнеса, а также повышение мотивации и клиентом, выражающаяся в поддержке и сопровождении человека до получения им необходимого результата в соответствии с его потребностями и целями.",
"хеджирование":" — способ страхования рисков, который дает инвесторам возможность реагировать на потенциальное изменение стоимости ценной бумаги или другого актива.",
"краудфандинг":" — практика финансирования проекта или предприятия путем сбора денег",
"дедлайн":" — сжатый срок, Крайний срок выполнения задачи или работы, определённый момент времени, к которому должна быть достигнута цель или задача.",
"оупенспейс":" — Это вариант планировки офисного помещения, при котором характерными чертами являются большое количество свободного пространства для менеджеров низшего и среднего уровней, несколько больших и просторных кабинетов для менеджеров высшего звена, небольшое количество закрытых переговорных комнат и наличие комнаты отдыха.",
"вендинг":" — Это продажа товаров и услуг с помощью автоматизированных систем. Вендинг получил широкое распространение в мире как удобный и не очень требовательный способ вести торговлю или оказывать услуги. Вендинг имеет различные направления и практически уместен во всех коммерческих сферах и сферах жизни общества.",
"превентивный":" — Предупреждающий что-либо; предохранительный; носящий предупредительный характер",
"бокс офис":" — кассовые сборы, Термин, обозначающий выручку от продажи билетов, применяемый в кинопрокате и театре. Отслеживание кассовых сборов имеет ключевое значение для современного коммерческого кинематографа, отображая экономическую успешность той или иной киноленты.",
"профит":" — польза; положительный результат какого-то процесса",
"фронт офис":" — Общее наименование группы подразделений или процессов в организациях, отвечающих за непосредственную работу с клиентами, заказчиками.",
"биллинг":" — выписывание счета, Комплекс процессов и решений на предприятиях связи, ответственных за сбор информации об использовании телекоммуникационных услуг, их тарификацию, выставление счетов абонентам, обработку платежей.",
"рисерч":" — исследование",
"бэк офис":" — это сотрудники компании которые не взаимодействуют с публикой. Они обеспечивают всю техническую деятельность компании, которая обычно скрыта от глаз.",
"бутстрэппинг":" — это способ финансирования небольших фирм посредством приобретения и использования ресурсов без увеличения акционерного капитала из традиционных источников или заимствования средств в банках",
"саммит":" — собрание директоров/специалистов",
"фандрейзинг":" — сбор пожертвований, Привлечение сторонних ресурсов для реализации социально значимых задач, культурных проектов или поддержания существования организации.",
"вендер":" — предприятие-поставщик, зачастую и сам производитель определенных товаров/услуг, которые предлагаются потребителю под собственной торговой маркой",
"сео":" — это набор методов и мер, которые призваны повысить значимость сайта в глазах поисковых систем для увеличения поискового трафика",
"аутсорсинг":" — это передача непрофильных функций компании сторонним организациям.",
"вижн":" — сформулированная в письменном виде концепция, описывающая смысл и цель вашего бизнеса для стейкхолдеров, то есть заинтересованных сторон, которые могут влиять на результаты вашего бизнеса.",
"стейкхолдеры":" — заинтересованные в вашем бизнесе стороны",
"нетворкинг":" — это формат встречи, где собираются участники, чтобы найти инвестора для проектов, партнера для бизнеса, подрядчика услуг или поставщика.",
"велости":" — это показатель способности превратить список задач продукта в работоспособный функционал за отрезок времени или определенную стоимость.",
"бэклог":" — то список задач, составленный на основе желаний и требований заказчика к системе, ее функциональности",
"факап":" — серьезный недочет, провал или ошибка, повлекшая за собой убытки в компании",
"эйчар":" — Специалист по подбору персонала",
"ворк-флоу":" — принцип организации рабочих процессов, в соответствии с которым повторяющиеся задачи представлены как последовательность стандартных шагов.",
};


function sorry(){
    alert("Sorry, this button is useless for now (:<)");
}
function sorryVer2(){
    alert("It seems we didn't found the meaning of this word yet. Or maybe you have written the word wrong");
    console.log("not found");
}
function tryToFind(input){
    input = input.toLowerCase();
    if (improvisation[input] === undefined){
        sorryVer2();
    }
    else{
        console.log("Entered1");
        answer(input);
    }
}

function answer(word){
    console.log("Entered2");
    let Sblock = document.createElement("div");
    let Sec = document.querySelector(".section")
    let art = document.querySelector(".article");
    console.log(Sec);
    Sblock.style.display= "flex";
    Sblock.style.alignItems = "center";
    Sblock.style.width= "100%";
    Sblock.style.position = "fixed";
    Sblock.style.height= "20px";
    Sblock.style.backgroundColor = "rgb(254, 183, 155)";
    Sblock.style.marginTop = "100px";
    console.log(Sblock);
    let ans = document.createElement("h3");
    ans.value = word + improvisation[word];
    console.log(ans.value);
    Sec.insertBefore(Sblock, art);
    Sblock.appendChild(ans);
}